In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('spam.csv')

In [4]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
4519,ham,What to think no one saying clearly. Ok leave ...,NaN,NaN,NaN
2230,ham,Hey... Thk we juz go accordin to wat we discus...,NaN,NaN,NaN
355,ham,Thank You for calling.Forgot to say Happy Onam...,NaN,NaN,NaN
2706,ham,S now only i took tablets . Reaction morning o...,NaN,NaN,NaN
815,ham,Where's my boytoy? I miss you ... What happened?,NaN,NaN,NaN

In [5]:
df.shape

(5572, 5)

## 1. Data Cleaning

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [9]:
# drop last 3 columns
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [10]:
df.sample(5)

       v1                                                 v2
1339  ham          Every monday..nxt week vl be completing..
5338  ham                          So when do you wanna gym?
3679  ham  I cant pick the phone right now. Pls send a me...
4544  ham  Never y lei... I v lazy... Got wat? Dat day Ì_...
495   ham                                   Got meh... When?

In [11]:
#renaming the cols
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(5)

     target                                               text
818     ham                        Then why you not responding
3298    ham  Honeybee Said: *I'm d Sweetest in d World* God...
1549    ham  Dude sux for snake. He got old and raiden got ...
409     ham  Message:some text missing* Sender:Name Missing...
1510    ham  Pete,is this your phone still? Its Jenny from ...

In [12]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [13]:
df['target']=encoder.fit_transform(df['target'])

In [14]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [15]:
# missing values
df.isnull().sum()

target    0
text      0
dtype: int64